Tekla Open API Reference for Tekla Structures 2025
ViewMarkBasicTagAttributes Properties
The ViewMarkBasicTagAttributes type exposes the following members.
Properties
Name | Description
Location
 The location of the mark tag.
Offset
 The offset of the mark tag.
TagContent
 The tag content.
Top
See Also
Reference
ViewMarkBasicTagAttributes Class
Tekla.Structures.Drawing Namespace